cassettes/akamai_api_eccu_publish/successful.yml

---
http_interactions:
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: |-
        <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd" xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:upload><filename xsi:type="xsd:string">./publish.xml</filename><contents xsi:type="xsd:base64Binary">PD94bWwgdmVyc2lvbj0iMS4wIj8+CjxlY2N1PgogIDxtYXRjaDpyZWN1cnNp
        dmUtZGlycyB2YWx1ZT0iZm9vIiA+CiAgICA8bWF0Y2g6cmVjdXJzaXZlLWRp
        cnMgdmFsdWU9ImJhciIgPgogICAgICA8bWF0Y2g6cmVjdXJzaXZlLWRpcnMg
        dmFsdWU9ImJhei5qcGciID4KICAgICAgICA8cmV2YWxpZGF0ZT5ub3c8L3Jl
        dmFsaWRhdGU+CiAgICAgIDwvbWF0Y2g6cmVjdXJzaXZlLWRpcnM+CiAgICA8
        L21hdGNoOnJlY3Vyc2l2ZS1kaXJzPgogIDwvbWF0Y2g6cmVjdXJzaXZlLWRp
        cnM+CjwvZWNjdT4=
        </contents><notes xsi:type="xsd:string">ECCU Request using AkamaiApi VERSION</notes><versionString xsi:type="xsd:string"></versionString><propertyName xsi:type="xsd:string">foo.com</propertyName><propertyType xsi:type="xsd:string">hostheader</propertyType><propertyNameExactMatch xsi:type="xsd:boolean">true</propertyNameExactMatch></akapubeccudt:upload></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"upload"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1265'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '477'
      Expires:
      - Tue, 20 May 2014 16:49:29 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 16:49:29 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:uploadResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><fileId
        xsi:type="xsd:int">116073578</fileId></ns1:uploadResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 16:49:29 GMT
- request:
    method: post
    uri: https://USERNAME:PASSWORD@control.akamai.com/webservices/services/PublishECCU
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:akapubeccudt="https://control.akamai.com/2003/Sep/PublishECCU.xsd"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="https://control.akamai.com/AWS.xsd"
        xmlns:ins1="https://control.akamai.com/Publish.xsd"><env:Body><akapubeccudt:getInfo><fileId
        xsi:type="xsd:int">116073578</fileId><retrieveContents xsi:type="xsd:boolean">true</retrieveContents></akapubeccudt:getInfo></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"getInfo"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '568'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - Apache
      Content-Type:
      - text/xml;charset=utf-8
      Content-Length:
      - '1964'
      Expires:
      - Tue, 20 May 2014 16:49:30 GMT
      Cache-Control:
      - max-age=0, no-cache, no-store
      Pragma:
      - no-cache
      Date:
      - Tue, 20 May 2014 16:49:30 GMT
      Connection:
      - keep-alive
      X-Frame-Options:
      - SAMEORIGIN
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><ns1:getInfoResponse
        soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://control.akamai.com/2003/Sep/PublishECCU.xsd"><EccuInfo
        xsi:type="ns2:EccuInfo" xmlns:ns2="https://control.akamai.com/Publish.xsd"><contents
        xsi:type="xsd:base64Binary">PD94bWwgdmVyc2lvbj0iMS4wIj8+CjxlY2N1PgogIDxtYXRjaDpicm9pa2VuLWRpcnMgdmFsdWU9ImZvbyIgPgogICAgPG1hdGNoOnJlY3Vyc2l2ZS1kaXJzIHZhbHVlPSJiYXIiID4KICAgICAgPG1hdGNoOnJlY3Vyc2l2ZS1kaXJzIHZhbHVlPSJiYXouanBnIiA+CiAgICAgICAgPHJldmFsaWRhdGU+bm93PC9yZXZhbGlkYXRlPgogICAgICA8L21hdGNoOnJlY3Vyc2l2ZS1kaXJzPgogICAgPC9tYXRjaDpyZWN1cnNpdmUtZGlycz4KICA8L21hdGNoOnJlY3Vyc2l2ZS1kaXJzPgo8L2VjY3U+</contents><extendedStatusMessage
        xsi:type="xsd:string" xsi:nil="true"/><fileId xsi:type="xsd:int">116073578</fileId><fileSize
        xsi:type="xsd:int">279</fileSize><filename xsi:type="xsd:string">./publish.xml</filename><md5Digest
        xsi:type="xsd:string">4a8dc79ed648407943bf3f1b315c32b3</md5Digest><notes xsi:type="xsd:string">ECCU
        Request using AkamaiApi gem</notes><propertyName xsi:type="xsd:string">foo.com</propertyName><propertyNameExactMatch
        xsi:type="xsd:boolean">true</propertyNameExactMatch><propertyType xsi:type="xsd:string">hostheader</propertyType><statusChangeEmail
        xsi:type="xsd:string" xsi:nil="true"/><statusCode xsi:type="xsd:int">1000</statusCode><statusMessage
        xsi:type="xsd:string">File uploaded and awaiting validation</statusMessage><statusUpdateDate
        xsi:type="xsd:dateTime">2014-05-20T16:49:29.026Z</statusUpdateDate><uploadDate
        xsi:type="xsd:dateTime">2014-05-20T16:49:29.026Z</uploadDate><uploadedBy xsi:type="xsd:string">test1</uploadedBy><versionString
        xsi:type="xsd:string" xsi:nil="true"/></EccuInfo></ns1:getInfoResponse></soapenv:Body></soapenv:Envelope>
    http_version:
  recorded_at: Tue, 20 May 2014 16:49:30 GMT
recorded_with: VCR 2.9.0
